# MultistoryStairsActualTreadDepth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MultistoryStairsActualTreadDepth Property
ParameterTypeId Class See Also
---
"Actual Tread Depth"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MultistoryStairsActualTreadDepth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MultistoryStairsActualTreadDepth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MultistoryStairsActualTreadDepth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace